#language: ru

  Функционал: Телевизоры
    Сценарий: Выбор телевизора с помощью фильтра

      Когда выбран пункт основного меню "Маркет"

      Когда выбран пункт основного меню Яндекс маркета"Электроника"

      #Когда выбран пункт раскрывающегося меню Яндекс маркета"Телевизоры"

      Когда выбран пункт из списка электроники"Телевизоры"

      Когда выбран расширенный фильтр

      Когда заполняются поля:
      |Цена от|20000|

      Когда выбран пункт из списка брэндов"Samsung"
      Когда выбран пункт из списка брэндов"LG"
        Тогда Нажата кнопка показать подходящие

      Когда Проверено, что отображается 12 элементов

      Когда в поискувую строку вставляется название первого элемента
        Тогда нажимается кнопка поиска